In [2]:
import pandas as pd

In [3]:
df = pd.read_csv("dvd rental final csv.csv")

In [4]:
df.shape

(14596, 17)

In [5]:
df.nunique()

inventory_id         4580
film_id               958
title                 958
rental_duration         5
rental_rate             3
length                140
replacement_cost       21
rating                  5
category               16
language                1
store_id                2
rental_id           14592
rental_date         14364
customer_id           599
return_date         14388
amount                 19
active                  2
dtype: int64

In [6]:
df[df.duplicated(keep=False)]

,inventory_id,film_id,title,rental_duration,rental_rate,length,replacement_cost,rating,category,language,store_id,rental_id,rental_date,customer_id,return_date,amount,active
13566,2276,492,Jungle Closer,6,0.99,134,11.99,NC-17,New,English,1,4591,2005-07-08 06:29:43,182,2005-07-17 07:20:43,3.99,1
14331,2276,492,Jungle Closer,6,0.99,134,11.99,NC-17,New,English,1,4591,2005-07-08 06:29:43,182,2005-07-17 07:20:43,3.99,1

In [7]:
df = df.drop_duplicates()

In [8]:
df

,inventory_id,film_id,title,rental_duration,rental_rate,length,replacement_cost,rating,category,language,store_id,rental_id,rental_date,customer_id,return_date,amount,active
0,3419,749,Rules Human,6,4.99,153,19.99,R,Horror,English,1,1520,2005-06-15 23:57:20,341,2005-06-24 23:46:20,7.99,1
1,2512,552,Majestic Floats,5,0.99,130,15.99,PG,Documentary,English,2,1778,2005-06-16 18:54:48,341,2005-06-22 16:08:48,1.99,1
2,2507,551,Maiden Home,3,4.99,138,9.99,PG,New,English,1,1849,2005-06-17 00:13:19,341,2005-06-23 18:37:19,7.99,1
3,2047,445,Hyde Doctor,5,2.99,100,11.99,G,Classics,English,1,2829,2005-06-19 21:11:30,341,2005-06-24 18:10:30,2.99,1
4,2569,563,Massacre Usual,6,4.99,165,16.99,R,Games,English,1,3130,2005-06-20 19:03:22,341,2005-06-29 18:05:22,7.99,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
14591,1148,254,Driver Annie,4,2.99,159,11.99,PG-13,Sports,English,1,12682,2006-02-14 15:16:03,245,NaN,2.99,1
14592,3998,870,Swarm Gold,4,0.99,123,12.99,PG-13,Horror,English,2,14107,2006-02-14 15:16:03,251,NaN,0.99,1
14593,1146,253,Drifter Commandments,5,4.99,61,18.99,PG-13,Action,English,2,13756,2006-02-14 15:16:03,252,NaN,4.99,1
14594,1219,270,Earth Vision,7,0.99,85,29.99,NC-17,New,English,2,15293,2006-02-14 15:16:03,263,NaN,0.99,1
14595,1489,326,Flying Hook,6,2.99,69,18.99,NC-17,Animation,English,2,14243,2006-02-14 15:16:03,264,NaN,2.99,1

In [9]:
df.isnull().sum()

inventory_id          0
film_id               0
title                 0
rental_duration       0
rental_rate           0
length                0
replacement_cost      0
rating                0
category              0
language              0
store_id              0
rental_id             0
rental_date           0
customer_id           0
return_date         183
amount                0
active                0
dtype: int64

In [10]:
(185/len(df))*100

1.2675573826652964

In [11]:
#dropping the rows of return_date
df.dropna(subset='return_date',inplace=True)

In [12]:
df.isnull().sum()

inventory_id        0
film_id             0
title               0
rental_duration     0
rental_rate         0
length              0
replacement_cost    0
rating              0
category            0
language            0
store_id            0
rental_id           0
rental_date         0
customer_id         0
return_date         0
amount              0
active              0
dtype: int64

In [13]:
df

,inventory_id,film_id,title,rental_duration,rental_rate,length,replacement_cost,rating,category,language,store_id,rental_id,rental_date,customer_id,return_date,amount,active
0,3419,749,Rules Human,6,4.99,153,19.99,R,Horror,English,1,1520,2005-06-15 23:57:20,341,2005-06-24 23:46:20,7.99,1
1,2512,552,Majestic Floats,5,0.99,130,15.99,PG,Documentary,English,2,1778,2005-06-16 18:54:48,341,2005-06-22 16:08:48,1.99,1
2,2507,551,Maiden Home,3,4.99,138,9.99,PG,New,English,1,1849,2005-06-17 00:13:19,341,2005-06-23 18:37:19,7.99,1
3,2047,445,Hyde Doctor,5,2.99,100,11.99,G,Classics,English,1,2829,2005-06-19 21:11:30,341,2005-06-24 18:10:30,2.99,1
4,2569,563,Massacre Usual,6,4.99,165,16.99,R,Games,English,1,3130,2005-06-20 19:03:22,341,2005-06-29 18:05:22,7.99,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
14409,650,141,Chicago North,6,4.99,185,11.99,PG-13,Games,English,1,5340,2005-07-09 17:11:35,267,2005-07-17 17:59:35,6.99,1
14410,1679,366,Goldfinger Sensibility,3,0.99,93,29.99,G,Drama,English,2,6070,2005-07-11 04:47:42,267,2005-07-13 01:49:42,0.99,1
14411,4552,993,Wrong Behavior,6,2.99,178,10.99,PG-13,Children,English,2,6706,2005-07-12 12:59:16,267,2005-07-19 10:37:16,3.99,1
14412,2290,496,Kick Savannah,3,0.99,179,10.99,PG-13,Travel,English,2,8190,2005-07-28 22:47:06,267,2005-08-04 21:51:06,4.99,1
14413,2815,618,Necklace Outbreak,3,0.99,132,21.99,PG,Drama,English,2,8572,2005-07-29 11:51:24,267,2005-08-02 11:44:24,1.99,1

In [14]:
# Convert the 'date' column to datetime
df['rental_date'] = pd.to_datetime(df['rental_date'])

# Extract year, month, day, hour, minute, and second
df['rental_year'] = df['rental_date'].dt.year
df['rental_month'] = df['rental_date'].dt.month
df['rental_day'] = df['rental_date'].dt.day
df['rental_hour'] = df['rental_date'].dt.hour
df['rental_minute'] = df['rental_date'].dt.minute

df.drop('rental_date', axis=1, inplace=True)

df.head()

,inventory_id,film_id,title,rental_duration,rental_rate,length,replacement_cost,rating,category,language,...,rental_id,customer_id,return_date,amount,active,rental_year,rental_month,rental_day,rental_hour,rental_minute
0,3419,749,Rules Human,6,4.99,153,19.99,R,Horror,English,...,1520,341,2005-06-24 23:46:20,7.99,1,2005,6,15,23,57
1,2512,552,Majestic Floats,5,0.99,130,15.99,PG,Documentary,English,...,1778,341,2005-06-22 16:08:48,1.99,1,2005,6,16,18,54
2,2507,551,Maiden Home,3,4.99,138,9.99,PG,New,English,...,1849,341,2005-06-23 18:37:19,7.99,1,2005,6,17,0,13
3,2047,445,Hyde Doctor,5,2.99,100,11.99,G,Classics,English,...,2829,341,2005-06-24 18:10:30,2.99,1,2005,6,19,21,11
4,2569,563,Massacre Usual,6,4.99,165,16.99,R,Games,English,...,3130,341,2005-06-29 18:05:22,7.99,1,2005,6,20,19,3

In [15]:
df['return_date'] = pd.to_datetime(df['return_date'])

# Extract year, month, day, hour, minute, and second
df['return_year'] = df['return_date'].dt.year
df['return_month'] = df['return_date'].dt.month
df['return_day'] = df['return_date'].dt.day
df['return_hour'] = df['return_date'].dt.hour
df['return_minute'] = df['return_date'].dt.minute

df.drop('return_date', axis=1, inplace=True)

In [16]:
df

,inventory_id,film_id,title,rental_duration,rental_rate,length,replacement_cost,rating,category,language,...,rental_year,rental_month,rental_day,rental_hour,rental_minute,return_year,return_month,return_day,return_hour,return_minute
0,3419,749,Rules Human,6,4.99,153,19.99,R,Horror,English,...,2005,6,15,23,57,2005,6,24,23,46
1,2512,552,Majestic Floats,5,0.99,130,15.99,PG,Documentary,English,...,2005,6,16,18,54,2005,6,22,16,8
2,2507,551,Maiden Home,3,4.99,138,9.99,PG,New,English,...,2005,6,17,0,13,2005,6,23,18,37
3,2047,445,Hyde Doctor,5,2.99,100,11.99,G,Classics,English,...,2005,6,19,21,11,2005,6,24,18,10
4,2569,563,Massacre Usual,6,4.99,165,16.99,R,Games,English,...,2005,6,20,19,3,2005,6,29,18,5
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
14409,650,141,Chicago North,6,4.99,185,11.99,PG-13,Games,English,...,2005,7,9,17,11,2005,7,17,17,59
14410,1679,366,Goldfinger Sensibility,3,0.99,93,29.99,G,Drama,English,...,2005,7,11,4,47,2005,7,13,1,49
14411,4552,993,Wrong Behavior,6,2.99,178,10.99,PG-13,Children,English,...,2005,7,12,12,59,2005,7,19,10,37
14412,2290,496,Kick Savannah,3,0.99,179,10.99,PG-13,Travel,English,...,2005,7,28,22,47,2005,8,4,21,51
14413,2815,618,Necklace Outbreak,3,0.99,132,21.99,PG,Drama,English,...,2005,7,29,11,51,2005,8,2,11,44

In [17]:
df.shape

(14412, 25)

In [18]:
df.nunique()

inventory_id         4580
film_id               958
title                 958
rental_duration         5
rental_rate             3
length                140
replacement_cost       21
rating                  5
category               16
language                1
store_id                2
rental_id           14409
customer_id           599
amount                 12
active                  2
rental_year             1
rental_month            3
rental_day             26
rental_hour            24
rental_minute          60
return_year             1
return_month            4
return_day             31
return_hour            24
return_minute          60
dtype: int64

In [19]:
# since rental year and return year has only one value for all the entries, so removing that column
df.drop (['return_year','rental_year'], axis=1,inplace=True)

In [20]:
df.nunique()

inventory_id         4580
film_id               958
title                 958
rental_duration         5
rental_rate             3
length                140
replacement_cost       21
rating                  5
category               16
language                1
store_id                2
rental_id           14409
customer_id           599
amount                 12
active                  2
rental_month            3
rental_day             26
rental_hour            24
rental_minute          60
return_month            4
return_day             31
return_hour            24
return_minute          60
dtype: int64

In [21]:
from sklearn.preprocessing import OneHotEncoder

In [34]:
encoder = OneHotEncoder()

In [23]:
language_encoded = encoder.fit_transform(df[['category']])

In [24]:
encoder.categories_

[array(['Action', 'Animation', 'Children', 'Classics', 'Comedy',
        'Documentary', 'Drama', 'Family', 'Foreign', 'Games', 'Horror',
        'Music', 'New', 'Sci-Fi', 'Sports', 'Travel'], dtype=object)]

In [25]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 14412 entries, 0 to 14413
Data columns (total 23 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   inventory_id      14412 non-null  int64
 1   film_id           14412 non-null  int64
 2   title             14412 non-null  object
 3   rental_duration   14412 non-null  int64
 4   rental_rate       14412 non-null  float64
 5   length            14412 non-null  int64
 6   replacement_cost  14412 non-null  float64
 7   rating            14412 non-null  object
 8   category          14412 non-null  object
 9   language          14412 non-null  object
 10  store_id          14412 non-null  int64
 11  rental_id         14412 non-null  int64
 12  customer_id       14412 non-null  int64
 13  amount            14412 non-null  float64
 14  active            14412 non-null  int64
 15  rental_month      14412 non-null  int32
 16  rental_day        14412 non-null  int32
 17  rental_hour       14412 non-null  int32
 18  rental_minute     14412 non-null  int32
 19  return_month      14412 non-null  int32
 20  return_day        14412 non-null  int32
 21  return_hour       14412 non-null  int32
 22  return_minute     14412 non-null  int32
dtypes: float64(3), int32(8), int64(8), object(4)
memory usage: 2.2+ MB

In [35]:
import pickle

In [40]:
df.columns

Index(['inventory_id', 'film_id', 'rental_duration', 'rental_rate', 'length',
       'replacement_cost', 'rating', 'category', 'language', 'store_id',
       'rental_id', 'customer_id', 'amount', 'active', 'rental_month',
       'rental_day', 'rental_hour', 'rental_minute', 'return_month',
       'return_day', 'return_hour', 'return_minute'],
      dtype='object')

In [39]:
df.drop('title', axis=1,inplace=True)

In [41]:
for column in df.select_dtypes(include='object').columns:
    print(column)

rating
category
language

In [46]:
df.drop('language',axis=1,inplace=True)

In [47]:
df.columns

Index(['inventory_id', 'film_id', 'rental_duration', 'rental_rate', 'length',
       'replacement_cost', 'rating', 'category', 'store_id', 'rental_id',
       'customer_id', 'amount', 'active', 'rental_month', 'rental_day',
       'rental_hour', 'rental_minute', 'return_month', 'return_day',
       'return_hour', 'return_minute'],
      dtype='object')

In [43]:
encoder = OneHotEncoder(sparse_output=False)

language_encoded = encoder.fit_transform(df[['language']])

In [44]:
encoder.categories_

[array(['English             '], dtype=object)]

In [53]:
#encoding
encoders = {}
for column in df.select_dtypes(include='object').columns:
    encoder = OneHotEncoder(sparse_output=False)
    df[column] = encoder.fit_transform(df[[column]])
    encoders[column] = encoder

with open('onehotencoders.pkl', 'wb') as f:
    pickle.dump(encoders, f)

In [55]:
encoders['rating'].categories_

[array(['G', 'NC-17', 'PG', 'PG-13', 'R'], dtype=object)]

In [51]:
df['rating'].value_counts() #onehot encoder

rating
PG-13    3203
NC-17    2963
PG       2903
R        2868
G        2475
Name: count, dtype: int64

In [52]:
df['category'].value_counts() #onehot encoder

category
Sports         1066
Animation      1044
Action          996
Sci-Fi          990
Family          975
Drama           946
Foreign         942
Documentary     930
Games           870
Children        855
Classics        851
New             850
Comedy          842
Horror          761
Travel          755
Music           739
Name: count, dtype: int64

In [56]:
df.shape

(14412, 21)